Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray
An array that contains boundary segment arrays.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.Insert(Autodesk.Revit.DB.Mechanicals.BoundarySegmentArray,System.Int32)
System.Int32
Insert the specified boundary segment array into the array.
item: The boundary segment array to be inserted into the array.
index: The boundary segment array will be inserted before this index.
Returns: Returns whether the boundary segment array was inserted into the array.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.ReverseIterator
Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.ForwardIterator
Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.Append(Autodesk.Revit.DB.Mechanical.BoundarySegmentArray)
void
Add the boundary segment array to the end of the array.
item: The boundary segment array to be added.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.Clear
void
Removes every boundary segment array from the array, rendering it empty.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.Size
System.Int32
get
Returns the number of boundary segment arrays that are in the array.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.Item(System.Int32)
System.Object
Gets or sets a boundary segment array at a specified index within the array.
index: The index of the boundary segment array to be set or retrieved.
Returns: Returns the boundary segment array at the specified index.

Autodesk.Revit.DB.Mechanical.BoundarySegmentArrayArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.